function findMissingNumber(arr) {
  for (var i = 0; i < arr.length - 1; i++) {    // ลูปวนซ้ำตั้งแต่ index ที่ 0 จนถึง index สุดท้าย - 1 (ใช้ arr.length - 1 เพื่อป้องกันไม่ใช้ลูปเกิน เนื่องจากมีการใช้ arr[i+1])
    if(arr[i] + 1 !== arr[i+1]) {					// ตรวจสอบว่าถ้าค่าปัจจุบัน + 1 เท่ากับค่าถัดไปหรือไม่ (ถ้าไม่เท่าแปลว่าค่านั้นหายไป)
      return arr[i] + 1 ;			// ให้ return คืนค่าที่หายไป
      }
  }
  return "None" ;				// ถ้าทุกเลขใน Array เรียงต่อเนื่องกัน ไม่มีเลขไหนหายไป ให้คืนค่า None
}